[{
  "_id": "https://thehackernews.com/2023/11/new-campaign-targets-middle-east.html",
  "text": "Government entities in the Middle East are the target of new phishing campaigns that are designed to deliver a new initial access downloader dubbed IronWind.\n\nThe activity, detected between July and October 2023, has been attributed by Proofpoint to a threat actor it tracks under the name TA402, which is also known as Molerats, Gaza Cyber Gang, and shares tactical overlaps with a pro-Hamas hacking crew known as APT-C-23 (aka Arid Viper).\n\n'When it comes to state-aligned threat actors, North Korea, Russia, China, and Iran generally reap the lion's share of attention,' Joshua Miller, senior threat researcher at Proofpoint, said in a statement shared with The Hacker News.\n\n'But TA402, a Middle Eastern advanced persistent threat (APT) group that historically has operated in the interests of the Palestinian Territories, has consistently proven to be an intriguing threat actor capable of highly sophisticated cyber espionage with a focus on intelligence collection.'\n\nCoinciding with the use of IronWind are consistent updates to its malware delivery mechanisms, using Dropbox links, XLL file attachments, and RAR archives to distribute IronWind.\n\nThe use of IronWind is a shift from prior attack chains, which were linked to the propagation of a backdoor codenamed NimbleMamba in intrusions targeting Middle Eastern governments and foreign policy think tanks.\n\nTA402's latest campaigns are characterized by the use of a compromised email account belonging to the Ministry of Foreign Affairs to send phishing lures pointing to Dropbox links that facilitate the deployment of IronWind.\n\nThe downloader is engineered to contact an attacker-controlled server to fetch additional payloads, including a post-exploitation toolkit called SharpSploit, following a multi-stage sequence.\n\nSubsequent social engineering campaigns in August and October 2023 have been found to leverage XLL file and RAR archive attachments embedded in email messages to trigger the deployment of IronWind. Another notable tactic employed by the group is the reliance on geofencing techniques to complicate detection efforts.\n\n'The ongoing conflict in the Middle East does not appear to have hindered their ongoing operations, as they continue to iterate and use new and clever delivery methods to bypass detection efforts,' Miller said.\n\n'Using complex infection chains and drumming up new malware to attack their targets, TA402 continues to engage in extremely targeted activity with a strong focus on government entities based in the Middle East and North Africa.'\n\nThe development comes as Cisco Talos revealed that cybercriminals have been observed exploiting the 'Release scores' feature of Google Forms quizzes to deliver email and orchestrate elaborate cryptocurrency scams, highlighting the creative ways threat actors resort to in order to meet their objectives.\n\n'The emails originate from Google's own servers and consequently may have an easier time bypassing anti-spam protections and finding the victim's inbox,' security researcher Jaeson Schultz said last week.",
  "caps_title": "New Campaign Targets Middle East Governments with IronWind Malware",
  "date_time": "14 November 2023",
  "target_list": "North Korea, Russia, China",
  "harvest_date": {
    "$date": "2023-11-15T10:35:51.378Z"
  },
  
  {"_id":{"$oid":"6818c111798035197a071356"},"assessment":{"title":"Azerbaijan blames Russian state hackers for cyberattacks on local media","url":"https:\/\/therecord.media\/azerbaijan-blames-media-cyberattacks-russia-apt29","summary":"Azerbaijan has accused the Russian state-sponsored hacker group APT29 of conducting a cyberattack on multiple Azerbaijani media outlets. The attack is considered retaliation for Azerbaijan's closure of the Russian House cultural center and staff reductions at Sputnik Azerbaijan. The cyberattack on February 20 targeted the internal servers of Baku TV and spread to other news websites, aiming to spread disinformation, disrupt infrastructure, and alter information. Azerbaijani authorities link these actions to ongoing geopolitical tensions with Russia, exacerbated by Azerbaijan's support for Ukraine.","cyber_related":true,"threat_actors":["APT29"],"malware":[],"cve_vulns":[],"affected_products":[],"iocs":[],"mitre_ttps":[],"victims":["Azerbaijani Media Outlets"],"sectors":["Media"],"patch_availability":false,"affects_singapore":false,"affects_asean":false,"active_exploitation":true,"high_tension_event":true,"gics_sector":["Communication Services"],"csa_cii_sector":["Media"],"possible_motivations":["Espionage"],"recommendations_and_mitigations":["Conduct Regular Security Audits And Vulnerability Assessments.","Enhance Employee Awareness And Training On Phishing And Other Social Engineering Attacks.","Implement Rigorous Access Controls And Network Monitoring.","Strengthen Cybersecurity Defenses For Media Organizations."],"cve_severity":"None"},"markdown":"![Russian House in Baku, Azerbaijan](https:\/\/cms.therecord.media\/uploads\/format_webp\/large_Rus_Evi_02_Baku_ec5b56da3c.jpg)\nThe Russian House in Baku, Azerbaijan's capital. Image: Nemoralis via Wikimedia Commons \/ CC BY-SA 4.0\n[Daryna Antoniuk](https:\/\/therecord.media\/author\/daryna-antoniuk)May 5th, 2025\n# Azerbaijan blames Russian state hackers for cyberattacks on local media\nAzerbaijani officials claimed that the Russian state-sponsored hacker group APT29 was behind a cyberattack on several local media outlets earlier this year. \nThe likely motive, according to Ramid Namazov, head of the Azerbaijani parliament's commission on countering hybrid threats, was retaliation for the closure of the Russian House state-funded cultural center in Baku and significant staff cuts at the Azerbaijani branch of Sputnik radio. \nIn February, the Azerbaijani government [ordered](https:\/\/www.themoscowtimes.com\/2025\/02\/06\/azerbaijan-orders-closure-of-russian-cultural-diplomacy-agency-in-baku-a87887) the closure of the Russian House, citing its lack of legal registration and violations of national legislation. Local media also [reported](https:\/\/t.me\/Ateobreaking\/139022) that the center had been involved in espionage activities on behalf of Russian intelligence. Russia dismissed the allegations as a “groundless” disinformation campaign. \nAzerbaijani authorities cut the staff of the Kremlin-backed outlet Sputnik Azerbaijan from 40 to a single employee earlier this year, [saying](https:\/\/caliber.az\/arm\/post\/n-sputnik-azerbayjan-baqun-veracnum-e-asimetrian) the move was aimed at “restoring balance” in the conditions under which Azerbaijani state media and foreign journalists operate in the country. \nThe [cyberattack](https:\/\/ru.apa.az\/vneshnyaya-politika\/ramid-namazov-20-fevralya-ataki-na-mediaresursy-byli-soverseny-gruppoi-svyazannoi-s-rossiei-609354) on Azerbaijani media took place on the morning of February 20. It initially targeted the internal servers of the Baku TV channel — which had accused the Russian House of espionage — before spreading to several news websites. \nAccording to local authorities, the attack [aimed](https:\/\/news.az\/news\/cyberattack-targets-azerbaijani-media-who-hit-global-media-group) to spread disinformation and false news, disrupt media infrastructure and attempt to delete or alter information. \nNamazov said the incident was “politically motivated” and claimed that Russian hackers had penetrated the affected websites two to three years before the actual incident. \nAPT29, also known as [Cozy Bear](https:\/\/therecord.media\/search-results?term=APT29), BlueBravo or Midnight Blizzard, is reportedly affiliated with Russia’s Foreign Intelligence Service (SVR). The group is primarily engaged in cyber-espionage, targeting government agencies, foreign diplomatic missions, and organizations in the political, defense, energy and media sectors. \nAzerbaijan has historically maintained ties with Russia through trade, energy and security cooperation. However, tensions have escalated recently — partly due to Baku's [support](https:\/\/kyivindependent.com\/azerbaijan-to-deliver-1-million-in-humanitarian-aid-to-ukraine\/) for Ukraine. The December [crash](https:\/\/kyivindependent.com\/absurd-versions-azerbaijans-president-accuses-russia-condemns-putins-denial-in-crash-case\/) of Flight J2-8243, which Azerbaijan blamed on a Russian missile, also complicated the relationship. \nIn March, Ukraine’s military intelligence agency, known as HUR, [reported](https:\/\/kyivindependent.com\/russia-spreading-disinformation-to-damage-ukraines-ties-with-armenia-azerbaijan-intelligence-claims\/) that Russia was spreading disinformation accusing HUR of trying to instigate an armed conflict between Armenia and Azerbaijan. \nCyberattacks on media outlets are commonly used by Russian hackers to [spread](https:\/\/therecord.media\/poland-prime-minister-cyber-targeted) disinformation or collect data. Last year, suspected Russian hackers targeted the Polish Press Agency to publish fake news on its website. \nIn February, Kremlin-linked threat actors also [attacked](https:\/\/therecord.media\/ukrainian-news-outlets-attacked-by-russian-hackers) several major Ukrainian media outlets, posting fake news related to the war. \n  * [](https:\/\/news.ycombinator.com\/submitlink?u=&t=Azerbaijan blames Russian state hackers for cyberattacks on local media)\n  * [](https:\/\/bsky.app\/intent\/compose?text=Azerbaijan blames Russian state hackers for cyberattacks on local media )\n\n\n  * [Government](https:\/\/therecord.media\/news\/government)\n  * [Industry](https:\/\/therecord.media\/)\n  * [Nation-state](https:\/\/therecord.media\/news\/nation-state)\n  * [News](https:\/\/therecord.media\/)\n\n\nGet more insights with the \nRecorded Future\nIntelligence Cloud.\n[Learn more.](https:\/\/www.recordedfuture.com\/platform?mtm_campaign=ad-unit-record)\nTags\n  * [media](https:\/\/therecord.media\/tag\/media)\n  * [television](https:\/\/therecord.media\/tag\/television)\n  * [Azerbaijan ](https:\/\/therecord.media\/tag\/azerbaijan)\n  * [Russia](https:\/\/therecord.media\/tag\/russia)\n  * [APT29](https:\/\/therecord.media\/tag\/apt29)\n  * [Cozy Bear](https:\/\/therecord.media\/tag\/cozy-bear)\n  * [Cyberattack](https:\/\/therecord.media\/tag\/cyberattack)\n  * [news media](https:\/\/therecord.media\/tag\/news-media)\n  * [disinformation](https:\/\/therecord.media\/tag\/disinformation)\n\n\nNo previous article\nNo new articles\n[![Daryna Antoniuk](https:\/\/cms.therecord.media\/uploads\/format_webp\/d887de47708acda42945a172d61c0ca2_38f4568326.png)](https:\/\/therecord.media\/author\/daryna-antoniuk)\n[Daryna Antoniuk](https:\/\/therecord.media\/author\/daryna-antoniuk)\nis a reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.\n## Briefs\n  * [US indicts Yemeni man in Black Kingdom ransomware attacksMay 2nd, 2025](https:\/\/therecord.media\/us-indicts-yemeni-man-black-kingdom-ransomware)\n  * [Ransomware attacks on food and agriculture industry have doubled in 2025May 2nd, 2025](https:\/\/therecord.media\/ransomware-attacks-food-and-ag-double-2025)\n  * [US wants to cut off key player in Southeast Asian cybercrime industryMay 2nd, 2025](https:\/\/therecord.media\/us-fincen-cut-off-huione-group-southeast-asia-cyber-scam)\n  * [Harrods becomes latest retailer to announce attempted cyberattackMay 2nd, 2025](https:\/\/therecord.media\/harrods-cyberattack-uk-retailer)\n  * [Defense contractors to pay $8.4 million over charges of failing to meet federal cyber standardsMay 1st, 2025](https:\/\/therecord.media\/defense-contractors-settle-with-dod-false-claims-act)\n  * [Nefilim ransomware suspect extradited from Spain to USMay 1st, 2025](https:\/\/therecord.media\/nefilim-ransomware-extradited-spain)\n  * [Poland’s state registry temporarily blocked by cyber incidentMay 1st, 2025](https:\/\/therecord.media\/poland-pesel-system-state-registry-cyber-incident)\n  * [DarkWatchman cybercrime malware returns on Russian networksApril 30th, 2025](https:\/\/therecord.media\/darkwatchman-malware-russia-cybercrime-hive0117)\n  * [Co-op announces ‘attempted’ cyberattack in wake of M&S incidentApril 30th, 2025](https:\/\/therecord.media\/co-op-uk-retailer-announces-attempted-cyber-incident)\n\n\n## [TerraStealerV2 and TerraLogger: Golden Chickens' New Malware Families Discovered![TerraStealerV2 and TerraLogger: Golden Chickens' New Malware Families Discovered](https:\/\/cms.recordedfuture.com\/uploads\/format_webp\/cta_2025_0501_Blog_Main_Feature_55a0e64897.jpg)](https:\/\/www.recordedfuture.com\/research\/terrastealerv2-and-terralogger)\n## [Uncovering MintsLoader With Recorded Future Malware Intelligence Hunting![Uncovering MintsLoader With Recorded Future Malware Intelligence Hunting](https:\/\/cms.recordedfuture.com\/uploads\/format_webp\/BLOG_cta_2025_0429_Main_Feature_e924c36cbd.jpg)](https:\/\/www.recordedfuture.com\/research\/uncovering-mintsloader-with-recorded-future-malware-intelligence-hunting)\n## [Iran’s AI Ambitions: Balancing Economic Isolation with National Security Imperatives![Iran’s AI Ambitions: Balancing Economic Isolation with National Security Imperatives](https:\/\/cms.recordedfuture.com\/uploads\/format_webp\/irans_ai_ambitions_balancing_economic_isolation_national_security_imperatives_151fba814d.png)](https:\/\/www.recordedfuture.com\/research\/irans-ai-ambitions-balancing-economic-isolation-national-security-imperatives)\n## [2024 Malicious Infrastructure Report![2024 Malicious Infrastructure Report](https:\/\/cms.recordedfuture.com\/uploads\/format_webp\/2024_malicious_infrastructure_report_95f6761bdf.png)](https:\/\/www.recordedfuture.com\/research\/2024-malicious-infrastructure-report)\n## [Stimmen aus Moskau: Russian Influence Operations Target German Elections![Stimmen aus Moskau: Russian Influence Operations Target German Elections](https:\/\/cms.recordedfuture.com\/uploads\/format_webp\/Main_Feature_65c13c676d.png)](https:\/\/www.recordedfuture.com\/research\/stimmen-aus-moskau-russian-influence-operations-target-german-elections)\n","assessment.url":"https:\/\/therecord.media\/azerbaijan-blames-media-cyberattacks-russia-apt29"}
  ]